Revit 2027 API
NonContinuousRailStructure.RemoveNonContinuousRail Method
 Removes Non-Continuous Rail from the Rail Structure.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveNonContinuousRail(
	int index
)
Public Sub RemoveNonContinuousRail (
	index As Integer
)
public:
void RemoveNonContinuousRail(
	int index
)
member RemoveNonContinuousRail :
        index : int -> unit
Parameters
index Int32
 Non-Continuous Rail index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index index is out of range.
See Also
Reference
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace